MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA406/mcu.h
#define CCP6STATL CCP6STATL
extern volatile uint16_t CCP6STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP6STATLBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP6STATLBITS;
extern volatile CCP6STATLBITS CCP6STATLbits __attribute__((__sfr__));

#define CCP6STATH CCP6STATH
extern volatile uint16_t CCP6STATH __attribute__((__sfr__));
typedef struct tagCCP6STATHBITS {
  uint16_t RAWIP:1;
  uint16_t RBWIP:1;
  uint16_t TMRLWIP:1;
  uint16_t TMRHWIP:1;
  uint16_t PRLWIP:1;
} CCP6STATHBITS;
extern volatile CCP6STATHBITS CCP6STATHbits __attribute__((__sfr__));

#define CCP6TMRL CCP6TMRL
extern volatile uint16_t CCP6TMRL __attribute__((__sfr__));
#define CCP6TMRH CCP6TMRH
extern volatile uint16_t CCP6TMRH __attribute__((__sfr__));
#define CCP6PRL CCP6PRL
extern volatile uint16_t CCP6PRL __attribute__((__sfr__));
#define CCP6PRH CCP6PRH
extern volatile uint16_t CCP6PRH __attribute__((__sfr__));
#define CCP6RA CCP6RA
extern volatile uint16_t CCP6RA __attribute__((__sfr__));
#define CCP6RAL CCP6RAL
extern volatile uint16_t CCP6RAL __attribute__((__sfr__));
#define CCP6RAH CCP6RAH
extern volatile uint16_t CCP6RAH __attribute__((__sfr__));
#define CCP6RB CCP6RB
extern volatile uint16_t CCP6RB __attribute__((__sfr__));
#define CCP6RBL CCP6RBL
extern volatile uint16_t CCP6RBL __attribute__((__sfr__));
#define CCP6RBH CCP6RBH
extern volatile uint16_t CCP6RBH __attribute__((__sfr__));
#define CCP6BUFL CCP6BUFL
extern volatile uint16_t CCP6BUFL __attribute__((__sfr__));
#define CCP6BUFH CCP6BUFH
extern volatile uint16_t CCP6BUFH __attribute__((__sfr__));
#define CCP7CON1L CCP7CON1L
extern volatile uint16_t CCP7CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP7CON1LBITS {
  union {
    struct {
      uint16_t MOD:4;
      uint16_t CCSEL:1;
      uint16_t T32:1;
      uint16_t TMRPS:2;
      uint16_t CLKSEL:3;
      uint16_t TMRSYNC:1;
      uint16_t CCPSLP:1;
      uint16_t CCPSIDL:1;
      uint16_t :1;
      uint16_t CCPON:1;
    };
    struct {
      uint16_t MOD0:1;
      uint16_t MOD1:1;
      uint16_t MOD2:1;
      uint16_t MOD3:1;
      uint16_t :1;
      uint16_t TMR32:1;
      uint16_t TMRPS0:1;
      uint16_t TMRPS1:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
      uint16_t CLKSEL2:1;
    };
    struct {
      uint16_t CCPMOD:4;
    };
    struct {
      uint16_t CCPMOD0:1;
      uint16_t CCPMOD1:1;
      uint16_t CCPMOD2:1;
      uint16_t CCPMOD3:1;
    };
  };
} CCP7CON1LBITS;
extern volatile CCP7CON1LBITS CCP7CON1Lbits __attribute__((__sfr__));

#define CCP7CON1H CCP7CON1H
extern volatile uint16_t CCP7CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP7CON1HBITS {
  union {
    struct {
      uint16_t SYNC:5;
      uint16_t ALTSYNC:1;
      uint16_t ONESHOT:1;
      uint16_t TRIGEN:1;
      uint16_t OPS:4;
      uint16_t :2;
      uint16_t RTRGEN:1;
      uint16_t OPSSRC:1;
    };
    struct {
      uint16_t SYNC0:1;
      uint16_t SYNC1:1;
      uint16_t SYNC2:1;
      uint16_t SYNC3:1;
      uint16_t SYNC4:1;
      uint16_t :3;
      uint16_t OPS0:1;
      uint16_t OPS1:1;
      uint16_t OPS2:1;
      uint16_t OPS3:1;
      uint16_t :3;
      uint16_t OPSRC:1;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS:4;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS0:1;
      uint16_t IOPS1:1;
      uint16_t IOPS2:1;
      uint16_t IOPS3:1;
    };
  };
} CCP7CON1HBITS;
extern volatile CCP7CON1HBITS CCP7CON1Hbits __attribute__((__sfr__));

#define CCP7CON2L CCP7CON2L
extern volatile uint16_t CCP7CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP7CON2LBITS {
  union {
    struct {
      uint16_t ASDG:8;
      uint16_t :4;
      uint16_t SSDG:1;
      uint16_t :1;
      uint16_t ASDGM:1;
      uint16_t PWMRSEN:1;
    };
    struct {
      uint16_t ASDG0:1;
      uint16_t ASDG1:1;
      uint16_t ASDG2:1;
      uint16_t ASDG3:1;
      uint16_t ASDG4:1;
      uint16_t ASDG5:1;
      uint16_t ASDG6:1;
      uint16_t ASDG7:1;
    };
  };
} CCP7CON2LBITS;
extern volatile CCP7CON2LBITS CCP7CON2Lbits __attribute__((__sfr__));

#define CCP7CON2H CCP7CON2H
extern volatile uint16_t CCP7CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP7CON2HBITS {
  union {
    struct {
      uint16_t ICS:3;
      uint16_t AUXOUT:2;
      uint16_t :1;
      uint16_t ICGSM:2;
      uint16_t OCAEN:1;
      uint16_t :6;
      uint16_t OENSYNC:1;
    };
    struct {
      uint16_t ICS0:1;
      uint16_t ICS1:1;
      uint16_t ICS2:1;
      uint16_t AUXOUT0:1;
      uint16_t AUXOUT1:1;
      uint16_t :1;
      uint16_t ICGSM0:1;
      uint16_t ICGSM1:1;
    };
    struct {
      uint16_t ICSEL:3;
    };
    struct {
      uint16_t ICSEL0:1;
      uint16_t ICSEL1:1;
      uint16_t ICSEL2:1;
    };
  };
} CCP7CON2HBITS;
extern volatile CCP7CON2HBITS CCP7CON2Hbits __attribute__((__sfr__));

#define CCP7CON3L CCP7CON3L
extern volatile uint16_t CCP7CON3L __attribute__((__sfr__));
__extension__ typedef struct tagCCP7CON3LBITS {
  union {
    struct {
      uint16_t DT:6;
    };
    struct {
      uint16_t DT0:1;
      uint16_t DT1:1;
      uint16_t DT2:1;
      uint16_t DT3:1;
      uint16_t DT4:1;
      uint16_t DT5:1;
    };
  };
} CCP7CON3LBITS;
extern volatile CCP7CON3LBITS CCP7CON3Lbits __attribute__((__sfr__));

#define CCP7CON3H CCP7CON3H
extern volatile uint16_t CCP7CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP7CON3HBITS {
  union {
    struct {
      uint16_t :2;
      uint16_t PSSACE:2;
      uint16_t :1;
      uint16_t POLACE:1;
      uint16_t :2;
      uint16_t OUTM:3;
      uint16_t :1;
      uint16_t OSCNT:3;
      uint16_t OETRIG:1;
    };
    struct {
      uint16_t :2;
      uint16_t PSSACE0:1;
      uint16_t PSSACE1:1;
      uint16_t :4;
      uint16_t OUTM0:1;
      uint16_t OUTM1:1;
      uint16_t OUTM2:1;
      uint16_t :1;
      uint16_t OSCNT0:1;
      uint16_t OSCNT1:1;
      uint16_t OSCNT2:1;
    };
  };
} CCP7CON3HBITS;
extern volatile CCP7CON3HBITS CCP7CON3Hbits __attribute__((__sfr__));

