MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA406/mcu.h
extern volatile U1EP2BITS U1EP2bits __attribute__((__sfr__));

#define U1EP3 U1EP3
extern volatile uint16_t U1EP3 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP3BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP3BITS;
extern volatile U1EP3BITS U1EP3bits __attribute__((__sfr__));

#define U1EP4 U1EP4
extern volatile uint16_t U1EP4 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP4BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP4BITS;
extern volatile U1EP4BITS U1EP4bits __attribute__((__sfr__));

#define U1EP5 U1EP5
extern volatile uint16_t U1EP5 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP5BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP5BITS;
extern volatile U1EP5BITS U1EP5bits __attribute__((__sfr__));

#define U1EP6 U1EP6
extern volatile uint16_t U1EP6 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP6BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP6BITS;
extern volatile U1EP6BITS U1EP6bits __attribute__((__sfr__));

#define U1EP7 U1EP7
extern volatile uint16_t U1EP7 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP7BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP7BITS;
extern volatile U1EP7BITS U1EP7bits __attribute__((__sfr__));

#define U1EP8 U1EP8
extern volatile uint16_t U1EP8 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP8BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP8BITS;
extern volatile U1EP8BITS U1EP8bits __attribute__((__sfr__));

#define U1EP9 U1EP9
extern volatile uint16_t U1EP9 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP9BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP9BITS;
extern volatile U1EP9BITS U1EP9bits __attribute__((__sfr__));

#define U1EP10 U1EP10
extern volatile uint16_t U1EP10 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP10BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP10BITS;
extern volatile U1EP10BITS U1EP10bits __attribute__((__sfr__));

#define U1EP11 U1EP11
extern volatile uint16_t U1EP11 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP11BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP11BITS;
extern volatile U1EP11BITS U1EP11bits __attribute__((__sfr__));

#define U1EP12 U1EP12
extern volatile uint16_t U1EP12 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP12BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP12BITS;
extern volatile U1EP12BITS U1EP12bits __attribute__((__sfr__));

#define U1EP13 U1EP13
extern volatile uint16_t U1EP13 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP13BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP13BITS;
extern volatile U1EP13BITS U1EP13bits __attribute__((__sfr__));

#define U1EP14 U1EP14
extern volatile uint16_t U1EP14 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP14BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP14BITS;
extern volatile U1EP14BITS U1EP14bits __attribute__((__sfr__));

#define U1EP15 U1EP15
extern volatile uint16_t U1EP15 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP15BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP15BITS;
extern volatile U1EP15BITS U1EP15bits __attribute__((__sfr__));

#define LCDCON LCDCON
extern volatile uint16_t LCDCON __attribute__((__sfr__));
__extension__ typedef struct tagLCDCONBITS {
  union {
    struct {
      uint16_t LMUX:3;
      uint16_t CS:2;
      uint16_t WERR:1;
      uint16_t SLPEN:1;
      uint16_t :6;
      uint16_t LCDSIDL:1;
      uint16_t :1;
      uint16_t LCDEN:1;
    };
    struct {
      uint16_t LMUX0:1;
      uint16_t LMUX1:1;
      uint16_t LMUX2:1;
      uint16_t CS0:1;
      uint16_t CS1:1;
    };
  };
} LCDCONBITS;
extern volatile LCDCONBITS LCDCONbits __attribute__((__sfr__));

#define LCDREF LCDREF
extern volatile uint16_t LCDREF __attribute__((__sfr__));
__extension__ typedef struct tagLCDREFBITS {
  union {
    struct {
      uint16_t LRLAT:3;
      uint16_t :1;
      uint16_t LRLBP:2;
      uint16_t LRLAP:2;
      uint16_t VLCD1PE:1;
      uint16_t VLCD2PE:1;
      uint16_t VLCD3PE:1;
      uint16_t LCDCST:3;
      uint16_t :1;
      uint16_t LCDIRE:1;
    };
    struct {
      uint16_t LRLAT0:1;
      uint16_t LRLAT1:1;
      uint16_t LRLAT2:1;
      uint16_t :1;
      uint16_t LRLBP0:1;
      uint16_t LRLBP1:1;
      uint16_t LRLAP0:1;
      uint16_t LRLAP1:1;
      uint16_t :3;
      uint16_t LCDCST0:1;
      uint16_t LCDCST1:1;
      uint16_t LCDCST2:1;
    };
  };
} LCDREFBITS;
extern volatile LCDREFBITS LCDREFbits __attribute__((__sfr__));

#define LCDPS LCDPS
extern volatile uint16_t LCDPS __attribute__((__sfr__));
__extension__ typedef struct tagLCDPSBITS {
  union {
    struct {
      uint16_t LP:4;
      uint16_t WA:1;
      uint16_t LCDA:1;
      uint16_t BIASMD:1;
      uint16_t WFT:1;
    };
    struct {
      uint16_t LP0:1;
      uint16_t LP1:1;
      uint16_t LP2:1;
      uint16_t LP3:1;
    };
  };
} LCDPSBITS;
extern volatile LCDPSBITS LCDPSbits __attribute__((__sfr__));

#define LCDDATA0 LCDDATA0
extern volatile uint16_t LCDDATA0 __attribute__((__sfr__));
typedef struct tagLCDDATA0BITS {
  uint16_t S00C0:1;
  uint16_t S01C0:1;
  uint16_t S02C0:1;
  uint16_t S03C0:1;
  uint16_t S04C0:1;
  uint16_t S05C0:1;
  uint16_t S06C0:1;
  uint16_t S07C0:1;
  uint16_t S08C0:1;
  uint16_t S09C0:1;
  uint16_t S10C0:1;
  uint16_t S11C0:1;
  uint16_t S12C0:1;
  uint16_t S13C0:1;
  uint16_t S14C0:1;
  uint16_t S15C0:1;
} LCDDATA0BITS;
extern volatile LCDDATA0BITS LCDDATA0bits __attribute__((__sfr__));

#define LCDDATA1 LCDDATA1
extern volatile uint16_t LCDDATA1 __attribute__((__sfr__));
typedef struct tagLCDDATA1BITS {
  uint16_t S16C0:1;
  uint16_t S17C0:1;
  uint16_t S18C0:1;
  uint16_t S19C0:1;
  uint16_t S20C0:1;
  uint16_t S21C0:1;
  uint16_t S22C0:1;
  uint16_t S23C0:1;
  uint16_t S24C0:1;
  uint16_t S25C0:1;
  uint16_t S26C0:1;
  uint16_t S27C0:1;
  uint16_t S28C0:1;
  uint16_t S29C0:1;
  uint16_t S30C0:1;
  uint16_t S31C0:1;
} LCDDATA1BITS;
extern volatile LCDDATA1BITS LCDDATA1bits __attribute__((__sfr__));

#define LCDDATA2 LCDDATA2
extern volatile uint16_t LCDDATA2 __attribute__((__sfr__));
typedef struct tagLCDDATA2BITS {
  uint16_t S32C0:1;
  uint16_t S33C0:1;
  uint16_t S34C0:1;
  uint16_t S35C0:1;
  uint16_t S36C0:1;
  uint16_t S37C0:1;
  uint16_t S38C0:1;
  uint16_t S39C0:1;
  uint16_t S40C0:1;
  uint16_t S41C0:1;
  uint16_t S42C0:1;
  uint16_t S43C0:1;
  uint16_t S44C0:1;
  uint16_t S45C0:1;
  uint16_t S46C0:1;
  uint16_t S47C0:1;
} LCDDATA2BITS;
extern volatile LCDDATA2BITS LCDDATA2bits __attribute__((__sfr__));

#define LCDDATA3 LCDDATA3
extern volatile uint16_t LCDDATA3 __attribute__((__sfr__));
typedef struct tagLCDDATA3BITS {
  uint16_t S48C0:1;
  uint16_t S49C0:1;
  uint16_t S50C0:1;
  uint16_t S51C0:1;
  uint16_t S52C0:1;
  uint16_t S53C0:1;
  uint16_t S54C0:1;
  uint16_t S55C0:1;
  uint16_t S56C0:1;
  uint16_t S57C0:1;
  uint16_t S58C0:1;
  uint16_t S59C0:1;
  uint16_t S60C0:1;
  uint16_t S61C0:1;
  uint16_t S62C0:1;
  uint16_t S63C0:1;
} LCDDATA3BITS;
