MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA406/mcu.h
extern volatile IOCPDHBITS IOCPDHbits __attribute__((__sfr__));

#define TRISJ TRISJ
extern volatile uint16_t TRISJ __attribute__((__sfr__));
typedef struct tagTRISJBITS {
  uint16_t TRISJ0:1;
  uint16_t TRISJ1:1;
} TRISJBITS;
extern volatile TRISJBITS TRISJbits __attribute__((__sfr__));

#define PORTJ PORTJ
extern volatile uint16_t PORTJ __attribute__((__sfr__));
typedef struct tagPORTJBITS {
  uint16_t RJ0:1;
  uint16_t RJ1:1;
} PORTJBITS;
extern volatile PORTJBITS PORTJbits __attribute__((__sfr__));

#define LATJ LATJ
extern volatile uint16_t LATJ __attribute__((__sfr__));
typedef struct tagLATJBITS {
  uint16_t LATJ0:1;
  uint16_t LATJ1:1;
} LATJBITS;
extern volatile LATJBITS LATJbits __attribute__((__sfr__));

#define ODCJ ODCJ
extern volatile uint16_t ODCJ __attribute__((__sfr__));
typedef struct tagODCJBITS {
  uint16_t ODCJ0:1;
  uint16_t ODCJ1:1;
} ODCJBITS;
extern volatile ODCJBITS ODCJbits __attribute__((__sfr__));

#define ANSELJ ANSELJ
extern volatile uint16_t ANSELJ __attribute__((__sfr__));
#define ANSJ ANSJ
extern volatile uint16_t ANSJ __attribute__((__sfr__));
#define IOCPJ IOCPJ
extern volatile uint16_t IOCPJ __attribute__((__sfr__));
typedef struct tagIOCPJBITS {
  uint16_t IOCPJ0:1;
  uint16_t IOCPJ1:1;
} IOCPJBITS;
extern volatile IOCPJBITS IOCPJbits __attribute__((__sfr__));

#define IOCNJ IOCNJ
extern volatile uint16_t IOCNJ __attribute__((__sfr__));
typedef struct tagIOCNJBITS {
  uint16_t IOCNJ0:1;
  uint16_t IOCNJ1:1;
} IOCNJBITS;
extern volatile IOCNJBITS IOCNJbits __attribute__((__sfr__));

#define IOCFJ IOCFJ
extern volatile uint16_t IOCFJ __attribute__((__sfr__));
typedef struct tagIOCFJBITS {
  uint16_t IOCFJ0:1;
  uint16_t IOCFJ1:1;
} IOCFJBITS;
extern volatile IOCFJBITS IOCFJbits __attribute__((__sfr__));

#define CNPUJ CNPUJ
extern volatile uint16_t CNPUJ __attribute__((__sfr__));
__extension__ typedef struct tagCNPUJBITS {
  union {
    struct {
      uint16_t IOCPJ0:1;
      uint16_t IOCPJ1:1;
    };
    struct {
      uint16_t IOCPUJ0:1;
      uint16_t IOCPUJ1:1;
    };
    struct {
      uint16_t CNPUJ0:1;
      uint16_t CNPUJ1:1;
    };
  };
} CNPUJBITS;
extern volatile CNPUJBITS CNPUJbits __attribute__((__sfr__));

#define IOCPUJ IOCPUJ
extern volatile uint16_t IOCPUJ __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUJBITS {
  union {
    struct {
      uint16_t IOCPJ0:1;
      uint16_t IOCPJ1:1;
    };
    struct {
      uint16_t IOCPUJ0:1;
      uint16_t IOCPUJ1:1;
    };
    struct {
      uint16_t CNPUJ0:1;
      uint16_t CNPUJ1:1;
    };
  };
} IOCPUJBITS;
extern volatile IOCPUJBITS IOCPUJbits __attribute__((__sfr__));

#define CNPDJ CNPDJ
extern volatile uint16_t CNPDJ __attribute__((__sfr__));
__extension__ typedef struct tagCNPDJBITS {
  union {
    struct {
      uint16_t IOCPDJ0:1;
      uint16_t IOCPDJ1:1;
    };
    struct {
      uint16_t CNPDJ0:1;
      uint16_t CNPDJ1:1;
    };
  };
} CNPDJBITS;
extern volatile CNPDJBITS CNPDJbits __attribute__((__sfr__));

#define IOCPDJ IOCPDJ
extern volatile uint16_t IOCPDJ __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDJBITS {
  union {
    struct {
      uint16_t IOCPDJ0:1;
      uint16_t IOCPDJ1:1;
    };
    struct {
      uint16_t CNPDJ0:1;
      uint16_t CNPDJ1:1;
    };
  };
} IOCPDJBITS;
extern volatile IOCPDJBITS IOCPDJbits __attribute__((__sfr__));

#define ADC1BUF0 ADC1BUF0
extern volatile uint16_t ADC1BUF0 __attribute__((__sfr__));
#define ADC1BUF1 ADC1BUF1
extern volatile uint16_t ADC1BUF1 __attribute__((__sfr__));
#define ADC1BUF2 ADC1BUF2
extern volatile uint16_t ADC1BUF2 __attribute__((__sfr__));
#define ADC1BUF3 ADC1BUF3
extern volatile uint16_t ADC1BUF3 __attribute__((__sfr__));
#define ADC1BUF4 ADC1BUF4
extern volatile uint16_t ADC1BUF4 __attribute__((__sfr__));
#define ADC1BUF5 ADC1BUF5
extern volatile uint16_t ADC1BUF5 __attribute__((__sfr__));
#define ADC1BUF6 ADC1BUF6
extern volatile uint16_t ADC1BUF6 __attribute__((__sfr__));
#define ADC1BUF7 ADC1BUF7
extern volatile uint16_t ADC1BUF7 __attribute__((__sfr__));
#define ADC1BUF8 ADC1BUF8
extern volatile uint16_t ADC1BUF8 __attribute__((__sfr__));
#define ADC1BUF9 ADC1BUF9
extern volatile uint16_t ADC1BUF9 __attribute__((__sfr__));
#define ADC1BUF10 ADC1BUF10
extern volatile uint16_t ADC1BUF10 __attribute__((__sfr__));
#define ADC1BUF11 ADC1BUF11
extern volatile uint16_t ADC1BUF11 __attribute__((__sfr__));
#define ADC1BUF12 ADC1BUF12
extern volatile uint16_t ADC1BUF12 __attribute__((__sfr__));
#define ADC1BUF13 ADC1BUF13
extern volatile uint16_t ADC1BUF13 __attribute__((__sfr__));
#define ADC1BUF14 ADC1BUF14
extern volatile uint16_t ADC1BUF14 __attribute__((__sfr__));
#define ADC1BUF15 ADC1BUF15
extern volatile uint16_t ADC1BUF15 __attribute__((__sfr__));
#define ADC1BUF16 ADC1BUF16
extern volatile uint16_t ADC1BUF16 __attribute__((__sfr__));
#define ADC1BUF17 ADC1BUF17
extern volatile uint16_t ADC1BUF17 __attribute__((__sfr__));
#define ADC1BUF18 ADC1BUF18
extern volatile uint16_t ADC1BUF18 __attribute__((__sfr__));
#define ADC1BUF19 ADC1BUF19
extern volatile uint16_t ADC1BUF19 __attribute__((__sfr__));
#define ADC1BUF20 ADC1BUF20
extern volatile uint16_t ADC1BUF20 __attribute__((__sfr__));
#define ADC1BUF21 ADC1BUF21
extern volatile uint16_t ADC1BUF21 __attribute__((__sfr__));
#define ADC1BUF22 ADC1BUF22
extern volatile uint16_t ADC1BUF22 __attribute__((__sfr__));
#define ADC1BUF23 ADC1BUF23
extern volatile uint16_t ADC1BUF23 __attribute__((__sfr__));
#define ADC1BUF24 ADC1BUF24
extern volatile uint16_t ADC1BUF24 __attribute__((__sfr__));
#define ADC1BUF25 ADC1BUF25
extern volatile uint16_t ADC1BUF25 __attribute__((__sfr__));
#define AD1CON1 AD1CON1
extern volatile uint16_t AD1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON1BITS {
  union {
    struct {
      uint16_t DONE:1;
      uint16_t SAMP:1;
      uint16_t ASAM:1;
      uint16_t :1;
      uint16_t SSRC:4;
      uint16_t FORM:2;
      uint16_t MODE12:1;
      uint16_t DMAEN:1;
      uint16_t DMABM:1;
      uint16_t ADSIDL:1;
      uint16_t :1;
      uint16_t ADON:1;
    };
    struct {
      uint16_t :4;
      uint16_t SSRC0:1;
      uint16_t SSRC1:1;
      uint16_t SSRC2:1;
      uint16_t SSRC3:1;
      uint16_t FORM0:1;
      uint16_t FORM1:1;
    };
  };
} AD1CON1BITS;
extern volatile AD1CON1BITS AD1CON1bits __attribute__((__sfr__));

#define AD1CON2 AD1CON2
extern volatile uint16_t AD1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON2BITS {
  union {
    struct {
      uint16_t ALTS:1;
      uint16_t BUFM:1;
      uint16_t SMPI:5;
      uint16_t BUFS:1;
      uint16_t :2;
      uint16_t CSCNA:1;
      uint16_t BUFREGEN:1;
      uint16_t OFFCAL:1;
      uint16_t NVCFG0:1;
      uint16_t PVCFG:2;
    };
    struct {
      uint16_t :2;
      uint16_t SMPI0:1;
      uint16_t SMPI1:1;
      uint16_t SMPI2:1;
      uint16_t SMPI3:1;
      uint16_t SMPI4:1;
      uint16_t :7;
      uint16_t PCVFG0:1;
      uint16_t PCVFG1:1;
    };
  };
} AD1CON2BITS;
extern volatile AD1CON2BITS AD1CON2bits __attribute__((__sfr__));

#define AD1CON3 AD1CON3
extern volatile uint16_t AD1CON3 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON3BITS {
  union {
    struct {
      uint16_t ADCS:8;
      uint16_t SAMC:5;
      uint16_t PUMPEN:1;
      uint16_t EXTSAM:1;
      uint16_t ADRC:1;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t ADCS7:1;
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
    };
  };
} AD1CON3BITS;
extern volatile AD1CON3BITS AD1CON3bits __attribute__((__sfr__));

#define AD1CHS AD1CHS
extern volatile uint16_t AD1CHS __attribute__((__sfr__));
__extension__ typedef struct tagAD1CHSBITS {
  union {
    struct {
      uint16_t CH0SA:5;
      uint16_t CH0NA:3;
      uint16_t CH0SB:5;
      uint16_t CH0NB:3;
    };
    struct {
      uint16_t CH0SA0:1;
      uint16_t CH0SA1:1;
      uint16_t CH0SA2:1;
      uint16_t CH0SA3:1;
      uint16_t CH0SA4:1;
      uint16_t CH0NA0:1;
      uint16_t CH0NA1:1;
      uint16_t CH0NA2:1;
      uint16_t CH0SB0:1;
      uint16_t CH0SB1:1;
      uint16_t CH0SB2:1;
      uint16_t CH0SB3:1;
      uint16_t CH0SB4:1;
      uint16_t CH0NB0:1;
      uint16_t CH0NB1:1;
      uint16_t CH0NB2:1;
    };
  };
} AD1CHSBITS;
extern volatile AD1CHSBITS AD1CHSbits __attribute__((__sfr__));

#define AD1CHS0 AD1CHS0
extern volatile uint16_t AD1CHS0 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CHS0BITS {
  union {
    struct {
      uint16_t CH0SA:5;
      uint16_t CH0NA:3;
      uint16_t CH0SB:5;
      uint16_t CH0NB:3;
    };
    struct {
      uint16_t CH0SA0:1;
      uint16_t CH0SA1:1;
      uint16_t CH0SA2:1;
      uint16_t CH0SA3:1;
      uint16_t CH0SA4:1;
      uint16_t CH0NA0:1;
      uint16_t CH0NA1:1;
      uint16_t CH0NA2:1;
      uint16_t CH0SB0:1;
      uint16_t CH0SB1:1;
      uint16_t CH0SB2:1;
      uint16_t CH0SB3:1;
      uint16_t CH0SB4:1;
      uint16_t CH0NB0:1;
      uint16_t CH0NB1:1;
      uint16_t CH0NB2:1;
    };
  };
} AD1CHS0BITS;
extern volatile AD1CHS0BITS AD1CHS0bits __attribute__((__sfr__));

#define AD1CSSH AD1CSSH
extern volatile uint16_t AD1CSSH __attribute__((__sfr__));
typedef struct tagAD1CSSHBITS {
  uint16_t :8;
  uint16_t CSS24:1;
  uint16_t CSS25:1;
  uint16_t :2;
  uint16_t CSS28:1;
  uint16_t CSS29:1;
  uint16_t CSS30:1;
  uint16_t CSS31:1;
} AD1CSSHBITS;
extern volatile AD1CSSHBITS AD1CSSHbits __attribute__((__sfr__));

#define AD1CSSL AD1CSSL
extern volatile uint16_t AD1CSSL __attribute__((__sfr__));
typedef struct tagAD1CSSLBITS {
  uint16_t CSS0:1;
  uint16_t CSS1:1;
  uint16_t CSS2:1;
  uint16_t CSS3:1;
  uint16_t CSS4:1;
  uint16_t CSS5:1;
  uint16_t CSS6:1;
  uint16_t CSS7:1;
  uint16_t CSS8:1;
  uint16_t CSS9:1;
  uint16_t CSS10:1;
  uint16_t CSS11:1;
  uint16_t CSS12:1;
  uint16_t CSS13:1;
  uint16_t CSS14:1;
  uint16_t CSS15:1;
} AD1CSSLBITS;
