MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA406/mcu.h
/* RTCCON1H */
#define _ALMRPT RTCCON1Hbits.ALMRPT
#define _AMASK RTCCON1Hbits.AMASK
#define _CHIME RTCCON1Hbits.CHIME
#define _ALRMEN RTCCON1Hbits.ALRMEN

/* RTCCON2L */
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
#define _PS RTCCON2Lbits.PS
#define _PWCPS RTCCON2Lbits.PWCPS
#define _FDIV RTCCON2Lbits.FDIV

/* RTCCON3L */
#define _PWCSTAB RTCCON3Lbits.PWCSTAB
#define _PWCSAMP RTCCON3Lbits.PWCSAMP

/* RTCSTATL */
#define _HALFSEC RTCSTATLbits.HALFSEC
#define _ALMSYNC RTCSTATLbits.ALMSYNC
/* Bitname _SYNC cannot be defined because it is used by more than one SFR */
#define _TSAEVT RTCSTATLbits.TSAEVT
#define _TSBEVT RTCSTATLbits.TSBEVT
#define _ALMEVT RTCSTATLbits.ALMEVT
#define _CPLCK RTCSTATLbits.CPLCK

/* TIMEL */
/* Bitname _SECONE cannot be defined because it is used by more than one SFR */
/* Bitname _SECTEN cannot be defined because it is used by more than one SFR */

/* TIMEH */
/* Bitname _MINONE cannot be defined because it is used by more than one SFR */
/* Bitname _MINTEN cannot be defined because it is used by more than one SFR */
/* Bitname _HRONE cannot be defined because it is used by more than one SFR */
/* Bitname _HRTEN cannot be defined because it is used by more than one SFR */

/* DATEL */
/* Bitname _WDAY cannot be defined because it is used by more than one SFR */
/* Bitname _DAYONE cannot be defined because it is used by more than one SFR */
/* Bitname _DAYTEN cannot be defined because it is used by more than one SFR */

/* DATEH */
/* Bitname _MTHONE cannot be defined because it is used by more than one SFR */
/* Bitname _MTHTEN cannot be defined because it is used by more than one SFR */
/* Bitname _YRONE cannot be defined because it is used by more than one SFR */
/* Bitname _YRTEN cannot be defined because it is used by more than one SFR */

/* ALMTIMEL */
/* Bitname _SECONE cannot be defined because it is used by more than one SFR */
/* Bitname _SECTEN cannot be defined because it is used by more than one SFR */

/* ALMTIMEH */
/* Bitname _MINONE cannot be defined because it is used by more than one SFR */
/* Bitname _MINTEN cannot be defined because it is used by more than one SFR */
/* Bitname _HRONE cannot be defined because it is used by more than one SFR */
/* Bitname _HRTEN cannot be defined because it is used by more than one SFR */

/* ALMDATEL */
/* Bitname _WDAY cannot be defined because it is used by more than one SFR */
/* Bitname _DAYONE cannot be defined because it is used by more than one SFR */
/* Bitname _DAYTEN cannot be defined because it is used by more than one SFR */

/* ALMDATEH */
/* Bitname _MTHONE cannot be defined because it is used by more than one SFR */
/* Bitname _MTHTEN cannot be defined because it is used by more than one SFR */
/* Bitname _YRONE cannot be defined because it is used by more than one SFR */
/* Bitname _YRTEN cannot be defined because it is used by more than one SFR */

/* TSATIMEL */
/* Bitname _SECONE cannot be defined because it is used by more than one SFR */
/* Bitname _SECTEN cannot be defined because it is used by more than one SFR */

/* TSATIMEH */
/* Bitname _MINONE cannot be defined because it is used by more than one SFR */
/* Bitname _MINTEN cannot be defined because it is used by more than one SFR */
/* Bitname _HRONE cannot be defined because it is used by more than one SFR */
/* Bitname _HRTEN cannot be defined because it is used by more than one SFR */

/* TSADATEL */
/* Bitname _WDAY cannot be defined because it is used by more than one SFR */
/* Bitname _DAYONE cannot be defined because it is used by more than one SFR */
/* Bitname _DAYTEN cannot be defined because it is used by more than one SFR */

/* TSADATEH */
/* Bitname _MTHONE cannot be defined because it is used by more than one SFR */
/* Bitname _MTHTEN cannot be defined because it is used by more than one SFR */
/* Bitname _YRONE cannot be defined because it is used by more than one SFR */
/* Bitname _YRTEN cannot be defined because it is used by more than one SFR */

/* TSBTIMEL */
/* Bitname _SECONE cannot be defined because it is used by more than one SFR */
/* Bitname _SECTEN cannot be defined because it is used by more than one SFR */

/* TSBTIMEH */
/* Bitname _MINONE cannot be defined because it is used by more than one SFR */
/* Bitname _MINTEN cannot be defined because it is used by more than one SFR */
/* Bitname _HRONE cannot be defined because it is used by more than one SFR */
/* Bitname _HRTEN cannot be defined because it is used by more than one SFR */

/* TSBDATEL */
/* Bitname _WDAY cannot be defined because it is used by more than one SFR */
/* Bitname _DAYONE cannot be defined because it is used by more than one SFR */
/* Bitname _DAYTEN cannot be defined because it is used by more than one SFR */

/* TSBDATEH */
/* Bitname _MTHONE cannot be defined because it is used by more than one SFR */
/* Bitname _MTHTEN cannot be defined because it is used by more than one SFR */
/* Bitname _YRONE cannot be defined because it is used by more than one SFR */
/* Bitname _YRTEN cannot be defined because it is used by more than one SFR */

/* IC1CON1 */
/* Bitname _ICM cannot be defined because it is used by more than one SFR */
/* Bitname _ICBNE cannot be defined because it is used by more than one SFR */
/* Bitname _ICOV cannot be defined because it is used by more than one SFR */
/* Bitname _ICI cannot be defined because it is used by more than one SFR */
/* Bitname _ICTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _ICSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _ICM0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICM1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICM2 cannot be defined because it is used by more than one SFR */
/* Bitname _ICI0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICI1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICTSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICTSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICTSEL2 cannot be defined because it is used by more than one SFR */

/* IC1CON2 */
/* Bitname _SYNCSEL cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _ICTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _IC32 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL4 cannot be defined because it is used by more than one SFR */

