MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA406/mcu.h
/* IOCNH */
#define _IOCNH0 IOCNHbits.IOCNH0
#define _IOCNH1 IOCNHbits.IOCNH1
#define _IOCNH2 IOCNHbits.IOCNH2
#define _IOCNH3 IOCNHbits.IOCNH3
#define _IOCNH4 IOCNHbits.IOCNH4
#define _IOCNH5 IOCNHbits.IOCNH5
#define _IOCNH6 IOCNHbits.IOCNH6
#define _IOCNH7 IOCNHbits.IOCNH7
#define _IOCNH8 IOCNHbits.IOCNH8
#define _IOCNH9 IOCNHbits.IOCNH9
#define _IOCNH10 IOCNHbits.IOCNH10
#define _IOCNH11 IOCNHbits.IOCNH11
#define _IOCNH12 IOCNHbits.IOCNH12
#define _IOCNH13 IOCNHbits.IOCNH13
#define _IOCNH14 IOCNHbits.IOCNH14
#define _IOCNH15 IOCNHbits.IOCNH15

/* IOCFH */
#define _IOCFH0 IOCFHbits.IOCFH0
#define _IOCFH1 IOCFHbits.IOCFH1
#define _IOCFH2 IOCFHbits.IOCFH2
#define _IOCFH3 IOCFHbits.IOCFH3
#define _IOCFH4 IOCFHbits.IOCFH4
#define _IOCFH5 IOCFHbits.IOCFH5
#define _IOCFH6 IOCFHbits.IOCFH6
#define _IOCFH7 IOCFHbits.IOCFH7
#define _IOCFH8 IOCFHbits.IOCFH8
#define _IOCFH9 IOCFHbits.IOCFH9
#define _IOCFH10 IOCFHbits.IOCFH10
#define _IOCFH11 IOCFHbits.IOCFH11
#define _IOCFH12 IOCFHbits.IOCFH12
#define _IOCFH13 IOCFHbits.IOCFH13
#define _IOCFH14 IOCFHbits.IOCFH14
#define _IOCFH15 IOCFHbits.IOCFH15

/* CNPUH */
/* Bitname _IOCPH0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH11 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH15 cannot be defined because it is used by more than one SFR */
#define _IOCPUH0 CNPUHbits.IOCPUH0
#define _IOCPUH1 CNPUHbits.IOCPUH1
#define _IOCPUH2 CNPUHbits.IOCPUH2
#define _IOCPUH3 CNPUHbits.IOCPUH3
#define _IOCPUH4 CNPUHbits.IOCPUH4
#define _IOCPUH5 CNPUHbits.IOCPUH5
#define _IOCPUH6 CNPUHbits.IOCPUH6
#define _IOCPUH7 CNPUHbits.IOCPUH7
#define _IOCPUH8 CNPUHbits.IOCPUH8
#define _IOCPUH9 CNPUHbits.IOCPUH9
#define _IOCPUH10 CNPUHbits.IOCPUH10
#define _IOCPUH11 CNPUHbits.IOCPUH11
#define _IOCPUH12 CNPUHbits.IOCPUH12
#define _IOCPUH13 CNPUHbits.IOCPUH13
#define _IOCPUH14 CNPUHbits.IOCPUH14
#define _IOCPUH15 CNPUHbits.IOCPUH15
#define _CNPUH0 CNPUHbits.CNPUH0
#define _CNPUH1 CNPUHbits.CNPUH1
#define _CNPUH2 CNPUHbits.CNPUH2
#define _CNPUH3 CNPUHbits.CNPUH3
#define _CNPUH4 CNPUHbits.CNPUH4
#define _CNPUH5 CNPUHbits.CNPUH5
#define _CNPUH6 CNPUHbits.CNPUH6
#define _CNPUH7 CNPUHbits.CNPUH7
#define _CNPUH8 CNPUHbits.CNPUH8
#define _CNPUH9 CNPUHbits.CNPUH9
#define _CNPUH10 CNPUHbits.CNPUH10
#define _CNPUH11 CNPUHbits.CNPUH11
#define _CNPUH12 CNPUHbits.CNPUH12
#define _CNPUH13 CNPUHbits.CNPUH13
#define _CNPUH14 CNPUHbits.CNPUH14
#define _CNPUH15 CNPUHbits.CNPUH15

/* CNPDH */
#define _IOCPDH0 CNPDHbits.IOCPDH0
#define _IOCPDH1 CNPDHbits.IOCPDH1
#define _IOCPDH2 CNPDHbits.IOCPDH2
#define _IOCPDH3 CNPDHbits.IOCPDH3
#define _IOCPDH4 CNPDHbits.IOCPDH4
#define _IOCPDH5 CNPDHbits.IOCPDH5
#define _IOCPDH6 CNPDHbits.IOCPDH6
#define _IOCPDH7 CNPDHbits.IOCPDH7
#define _IOCPDH8 CNPDHbits.IOCPDH8
#define _IOCPDH9 CNPDHbits.IOCPDH9
#define _IOCPDH10 CNPDHbits.IOCPDH10
#define _IOCPDH11 CNPDHbits.IOCPDH11
#define _IOCPDH12 CNPDHbits.IOCPDH12
#define _IOCPDH13 CNPDHbits.IOCPDH13
#define _IOCPDH14 CNPDHbits.IOCPDH14
#define _IOCPDH15 CNPDHbits.IOCPDH15
#define _CNPDH0 CNPDHbits.CNPDH0
#define _CNPDH1 CNPDHbits.CNPDH1
#define _CNPDH2 CNPDHbits.CNPDH2
#define _CNPDH3 CNPDHbits.CNPDH3
#define _CNPDH4 CNPDHbits.CNPDH4
#define _CNPDH5 CNPDHbits.CNPDH5
#define _CNPDH6 CNPDHbits.CNPDH6
#define _CNPDH7 CNPDHbits.CNPDH7
#define _CNPDH8 CNPDHbits.CNPDH8
#define _CNPDH9 CNPDHbits.CNPDH9
#define _CNPDH10 CNPDHbits.CNPDH10
#define _CNPDH11 CNPDHbits.CNPDH11
#define _CNPDH12 CNPDHbits.CNPDH12
#define _CNPDH13 CNPDHbits.CNPDH13
#define _CNPDH14 CNPDHbits.CNPDH14
#define _CNPDH15 CNPDHbits.CNPDH15

/* TRISJ */
#define _TRISJ0 TRISJbits.TRISJ0
#define _TRISJ1 TRISJbits.TRISJ1

/* PORTJ */
#define _RJ0 PORTJbits.RJ0
#define _RJ1 PORTJbits.RJ1

/* LATJ */
#define _LATJ0 LATJbits.LATJ0
#define _LATJ1 LATJbits.LATJ1

/* ODCJ */
#define _ODCJ0 ODCJbits.ODCJ0
#define _ODCJ1 ODCJbits.ODCJ1

/* IOCPJ */
/* Bitname _IOCPJ0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPJ1 cannot be defined because it is used by more than one SFR */

/* IOCNJ */
#define _IOCNJ0 IOCNJbits.IOCNJ0
#define _IOCNJ1 IOCNJbits.IOCNJ1

/* IOCFJ */
#define _IOCFJ0 IOCFJbits.IOCFJ0
#define _IOCFJ1 IOCFJbits.IOCFJ1

/* CNPUJ */
/* Bitname _IOCPJ0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPJ1 cannot be defined because it is used by more than one SFR */
#define _IOCPUJ0 CNPUJbits.IOCPUJ0
#define _IOCPUJ1 CNPUJbits.IOCPUJ1
#define _CNPUJ0 CNPUJbits.CNPUJ0
#define _CNPUJ1 CNPUJbits.CNPUJ1

/* CNPDJ */
#define _IOCPDJ0 CNPDJbits.IOCPDJ0
#define _IOCPDJ1 CNPDJbits.IOCPDJ1
#define _CNPDJ0 CNPDJbits.CNPDJ0
#define _CNPDJ1 CNPDJbits.CNPDJ1

/* AD1CON1 */
#define _DONE AD1CON1bits.DONE
#define _SAMP AD1CON1bits.SAMP
#define _ASAM AD1CON1bits.ASAM
#define _SSRC AD1CON1bits.SSRC
#define _FORM AD1CON1bits.FORM
#define _MODE12 AD1CON1bits.MODE12
#define _DMAEN AD1CON1bits.DMAEN
#define _DMABM AD1CON1bits.DMABM
#define _ADSIDL AD1CON1bits.ADSIDL
#define _ADON AD1CON1bits.ADON
#define _SSRC0 AD1CON1bits.SSRC0
#define _SSRC1 AD1CON1bits.SSRC1
#define _SSRC2 AD1CON1bits.SSRC2
#define _SSRC3 AD1CON1bits.SSRC3
#define _FORM0 AD1CON1bits.FORM0
#define _FORM1 AD1CON1bits.FORM1

