MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA406/mcu.h
#define _LCDSE3_SE58_POSITION                    0x0000000A
#define _LCDSE3_SE58_MASK                        0x00000400
#define _LCDSE3_SE58_LENGTH                      0x00000001

#define _LCDSE3_SE59_POSITION                    0x0000000B
#define _LCDSE3_SE59_MASK                        0x00000800
#define _LCDSE3_SE59_LENGTH                      0x00000001

#define _LCDSE3_SE60_POSITION                    0x0000000C
#define _LCDSE3_SE60_MASK                        0x00001000
#define _LCDSE3_SE60_LENGTH                      0x00000001

#define _LCDSE3_SE61_POSITION                    0x0000000D
#define _LCDSE3_SE61_MASK                        0x00002000
#define _LCDSE3_SE61_LENGTH                      0x00000001

#define _LCDSE3_SE62_POSITION                    0x0000000E
#define _LCDSE3_SE62_MASK                        0x00004000
#define _LCDSE3_SE62_LENGTH                      0x00000001

#define _LCDSE3_SE63_POSITION                    0x0000000F
#define _LCDSE3_SE63_MASK                        0x00008000
#define _LCDSE3_SE63_LENGTH                      0x00000001

#define _LCDREG_CLKSEL_POSITION                  0x00000000
#define _LCDREG_CLKSEL_MASK                      0x00000003
#define _LCDREG_CLKSEL_LENGTH                    0x00000002

#define _LCDREG_CPEN_POSITION                    0x0000000F
#define _LCDREG_CPEN_MASK                        0x00008000
#define _LCDREG_CPEN_LENGTH                      0x00000001

#define _PADCON_PMPTTL_POSITION                  0x00000000
#define _PADCON_PMPTTL_MASK                      0x00000001
#define _PADCON_PMPTTL_LENGTH                    0x00000001

#define _PADCON_IOCON_POSITION                   0x0000000F
#define _PADCON_IOCON_MASK                       0x00008000
#define _PADCON_IOCON_LENGTH                     0x00000001

#define _IOCSTAT_IOCPAF_POSITION                 0x00000000
#define _IOCSTAT_IOCPAF_MASK                     0x00000001
#define _IOCSTAT_IOCPAF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPBF_POSITION                 0x00000001
#define _IOCSTAT_IOCPBF_MASK                     0x00000002
#define _IOCSTAT_IOCPBF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPCF_POSITION                 0x00000002
#define _IOCSTAT_IOCPCF_MASK                     0x00000004
#define _IOCSTAT_IOCPCF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPDF_POSITION                 0x00000003
#define _IOCSTAT_IOCPDF_MASK                     0x00000008
#define _IOCSTAT_IOCPDF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPEF_POSITION                 0x00000004
#define _IOCSTAT_IOCPEF_MASK                     0x00000010
#define _IOCSTAT_IOCPEF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPFF_POSITION                 0x00000005
#define _IOCSTAT_IOCPFF_MASK                     0x00000020
#define _IOCSTAT_IOCPFF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPGF_POSITION                 0x00000006
#define _IOCSTAT_IOCPGF_MASK                     0x00000040
#define _IOCSTAT_IOCPGF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPHF_POSITION                 0x00000007
#define _IOCSTAT_IOCPHF_MASK                     0x00000080
#define _IOCSTAT_IOCPHF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPJF_POSITION                 0x00000008
#define _IOCSTAT_IOCPJF_MASK                     0x00000100
#define _IOCSTAT_IOCPJF_LENGTH                   0x00000001

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA2_POSITION                   0x00000002
#define _TRISA_TRISA2_MASK                       0x00000004
#define _TRISA_TRISA2_LENGTH                     0x00000001

#define _TRISA_TRISA3_POSITION                   0x00000003
#define _TRISA_TRISA3_MASK                       0x00000008
#define _TRISA_TRISA3_LENGTH                     0x00000001

#define _TRISA_TRISA4_POSITION                   0x00000004
#define _TRISA_TRISA4_MASK                       0x00000010
#define _TRISA_TRISA4_LENGTH                     0x00000001

#define _TRISA_TRISA5_POSITION                   0x00000005
#define _TRISA_TRISA5_MASK                       0x00000020
#define _TRISA_TRISA5_LENGTH                     0x00000001

#define _TRISA_TRISA6_POSITION                   0x00000006
#define _TRISA_TRISA6_MASK                       0x00000040
#define _TRISA_TRISA6_LENGTH                     0x00000001

#define _TRISA_TRISA7_POSITION                   0x00000007
#define _TRISA_TRISA7_MASK                       0x00000080
#define _TRISA_TRISA7_LENGTH                     0x00000001

#define _TRISA_TRISA9_POSITION                   0x00000009
#define _TRISA_TRISA9_MASK                       0x00000200
#define _TRISA_TRISA9_LENGTH                     0x00000001

#define _TRISA_TRISA10_POSITION                  0x0000000A
#define _TRISA_TRISA10_MASK                      0x00000400
#define _TRISA_TRISA10_LENGTH                    0x00000001

#define _TRISA_TRISA14_POSITION                  0x0000000E
#define _TRISA_TRISA14_MASK                      0x00004000
#define _TRISA_TRISA14_LENGTH                    0x00000001

#define _TRISA_TRISA15_POSITION                  0x0000000F
#define _TRISA_TRISA15_MASK                      0x00008000
#define _TRISA_TRISA15_LENGTH                    0x00000001

#define _PORTA_RA0_POSITION                      0x00000000
#define _PORTA_RA0_MASK                          0x00000001
#define _PORTA_RA0_LENGTH                        0x00000001

#define _PORTA_RA1_POSITION                      0x00000001
#define _PORTA_RA1_MASK                          0x00000002
#define _PORTA_RA1_LENGTH                        0x00000001

#define _PORTA_RA2_POSITION                      0x00000002
#define _PORTA_RA2_MASK                          0x00000004
#define _PORTA_RA2_LENGTH                        0x00000001

#define _PORTA_RA3_POSITION                      0x00000003
#define _PORTA_RA3_MASK                          0x00000008
#define _PORTA_RA3_LENGTH                        0x00000001

#define _PORTA_RA4_POSITION                      0x00000004
#define _PORTA_RA4_MASK                          0x00000010
#define _PORTA_RA4_LENGTH                        0x00000001

#define _PORTA_RA5_POSITION                      0x00000005
#define _PORTA_RA5_MASK                          0x00000020
#define _PORTA_RA5_LENGTH                        0x00000001

