MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA406/mcu.h
#define _ODCJ_ODCJ1_POSITION                     0x00000001
#define _ODCJ_ODCJ1_MASK                         0x00000002
#define _ODCJ_ODCJ1_LENGTH                       0x00000001

#define _IOCPJ_IOCPJ0_POSITION                   0x00000000
#define _IOCPJ_IOCPJ0_MASK                       0x00000001
#define _IOCPJ_IOCPJ0_LENGTH                     0x00000001

#define _IOCPJ_IOCPJ1_POSITION                   0x00000001
#define _IOCPJ_IOCPJ1_MASK                       0x00000002
#define _IOCPJ_IOCPJ1_LENGTH                     0x00000001

#define _IOCNJ_IOCNJ0_POSITION                   0x00000000
#define _IOCNJ_IOCNJ0_MASK                       0x00000001
#define _IOCNJ_IOCNJ0_LENGTH                     0x00000001

#define _IOCNJ_IOCNJ1_POSITION                   0x00000001
#define _IOCNJ_IOCNJ1_MASK                       0x00000002
#define _IOCNJ_IOCNJ1_LENGTH                     0x00000001

#define _IOCFJ_IOCFJ0_POSITION                   0x00000000
#define _IOCFJ_IOCFJ0_MASK                       0x00000001
#define _IOCFJ_IOCFJ0_LENGTH                     0x00000001

#define _IOCFJ_IOCFJ1_POSITION                   0x00000001
#define _IOCFJ_IOCFJ1_MASK                       0x00000002
#define _IOCFJ_IOCFJ1_LENGTH                     0x00000001

#define _CNPUJ_IOCPJ0_POSITION                   0x00000000
#define _CNPUJ_IOCPJ0_MASK                       0x00000001
#define _CNPUJ_IOCPJ0_LENGTH                     0x00000001

#define _CNPUJ_IOCPJ1_POSITION                   0x00000001
#define _CNPUJ_IOCPJ1_MASK                       0x00000002
#define _CNPUJ_IOCPJ1_LENGTH                     0x00000001

#define _CNPUJ_IOCPUJ0_POSITION                  0x00000000
#define _CNPUJ_IOCPUJ0_MASK                      0x00000001
#define _CNPUJ_IOCPUJ0_LENGTH                    0x00000001

#define _CNPUJ_IOCPUJ1_POSITION                  0x00000001
#define _CNPUJ_IOCPUJ1_MASK                      0x00000002
#define _CNPUJ_IOCPUJ1_LENGTH                    0x00000001

#define _CNPUJ_CNPUJ0_POSITION                   0x00000000
#define _CNPUJ_CNPUJ0_MASK                       0x00000001
#define _CNPUJ_CNPUJ0_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ1_POSITION                   0x00000001
#define _CNPUJ_CNPUJ1_MASK                       0x00000002
#define _CNPUJ_CNPUJ1_LENGTH                     0x00000001

#define _IOCPUJ_IOCPJ0_POSITION                  0x00000000
#define _IOCPUJ_IOCPJ0_MASK                      0x00000001
#define _IOCPUJ_IOCPJ0_LENGTH                    0x00000001

#define _IOCPUJ_IOCPJ1_POSITION                  0x00000001
#define _IOCPUJ_IOCPJ1_MASK                      0x00000002
#define _IOCPUJ_IOCPJ1_LENGTH                    0x00000001

#define _IOCPUJ_IOCPUJ0_POSITION                 0x00000000
#define _IOCPUJ_IOCPUJ0_MASK                     0x00000001
#define _IOCPUJ_IOCPUJ0_LENGTH                   0x00000001

#define _IOCPUJ_IOCPUJ1_POSITION                 0x00000001
#define _IOCPUJ_IOCPUJ1_MASK                     0x00000002
#define _IOCPUJ_IOCPUJ1_LENGTH                   0x00000001

#define _IOCPUJ_CNPUJ0_POSITION                  0x00000000
#define _IOCPUJ_CNPUJ0_MASK                      0x00000001
#define _IOCPUJ_CNPUJ0_LENGTH                    0x00000001

#define _IOCPUJ_CNPUJ1_POSITION                  0x00000001
#define _IOCPUJ_CNPUJ1_MASK                      0x00000002
#define _IOCPUJ_CNPUJ1_LENGTH                    0x00000001

#define _CNPDJ_IOCPDJ0_POSITION                  0x00000000
#define _CNPDJ_IOCPDJ0_MASK                      0x00000001
#define _CNPDJ_IOCPDJ0_LENGTH                    0x00000001

#define _CNPDJ_IOCPDJ1_POSITION                  0x00000001
#define _CNPDJ_IOCPDJ1_MASK                      0x00000002
#define _CNPDJ_IOCPDJ1_LENGTH                    0x00000001

#define _CNPDJ_CNPDJ0_POSITION                   0x00000000
#define _CNPDJ_CNPDJ0_MASK                       0x00000001
#define _CNPDJ_CNPDJ0_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ1_POSITION                   0x00000001
#define _CNPDJ_CNPDJ1_MASK                       0x00000002
#define _CNPDJ_CNPDJ1_LENGTH                     0x00000001

#define _IOCPDJ_IOCPDJ0_POSITION                 0x00000000
#define _IOCPDJ_IOCPDJ0_MASK                     0x00000001
#define _IOCPDJ_IOCPDJ0_LENGTH                   0x00000001

#define _IOCPDJ_IOCPDJ1_POSITION                 0x00000001
#define _IOCPDJ_IOCPDJ1_MASK                     0x00000002
#define _IOCPDJ_IOCPDJ1_LENGTH                   0x00000001

#define _IOCPDJ_CNPDJ0_POSITION                  0x00000000
#define _IOCPDJ_CNPDJ0_MASK                      0x00000001
#define _IOCPDJ_CNPDJ0_LENGTH                    0x00000001

#define _IOCPDJ_CNPDJ1_POSITION                  0x00000001
#define _IOCPDJ_CNPDJ1_MASK                      0x00000002
#define _IOCPDJ_CNPDJ1_LENGTH                    0x00000001

#define _AD1CON1_DONE_POSITION                   0x00000000
#define _AD1CON1_DONE_MASK                       0x00000001
#define _AD1CON1_DONE_LENGTH                     0x00000001

#define _AD1CON1_SAMP_POSITION                   0x00000001
#define _AD1CON1_SAMP_MASK                       0x00000002
#define _AD1CON1_SAMP_LENGTH                     0x00000001

#define _AD1CON1_ASAM_POSITION                   0x00000002
#define _AD1CON1_ASAM_MASK                       0x00000004
#define _AD1CON1_ASAM_LENGTH                     0x00000001

#define _AD1CON1_SSRC_POSITION                   0x00000004
#define _AD1CON1_SSRC_MASK                       0x000000F0
#define _AD1CON1_SSRC_LENGTH                     0x00000004

#define _AD1CON1_FORM_POSITION                   0x00000008
#define _AD1CON1_FORM_MASK                       0x00000300
#define _AD1CON1_FORM_LENGTH                     0x00000002

#define _AD1CON1_MODE12_POSITION                 0x0000000A
#define _AD1CON1_MODE12_MASK                     0x00000400
#define _AD1CON1_MODE12_LENGTH                   0x00000001

#define _AD1CON1_DMAEN_POSITION                  0x0000000B
#define _AD1CON1_DMAEN_MASK                      0x00000800
#define _AD1CON1_DMAEN_LENGTH                    0x00000001

